# Create & Access SQLite database using Python

In [4]:
import sqlite3

### Create database using SQLite

In [5]:
# Connecting to sqlite
# connection object

conn = sqlite3.connect("INSTRUCTOR.db")
cursor_obj = conn.cursor()

### Create a table in the database

In [6]:
# Drop table if already exists

cursor_obj.execute("DROP TABLE IF EXISTS INSTRUCTOR")

# Creating Table

table = table = """ create table IF NOT EXISTS INSTRUCTOR(ID INTEGER PRIMARY KEY NOT NULL, FNAME VARCHAR(20), LNAME VARCHAR(20), CITY VARCHAR(20), CCODE CHAR(2));"""

cursor_obj.execute(table)

print("Table is ready!")

Table is ready!

### Insert data into the table

In [7]:
cursor_obj.execute('''insert into INSTRUCTOR values (1, 'Rav', 'Ahuja', 'TORONTO', 'CA')''')

In [8]:
cursor_obj.execute('''insert into INSTRUCTOR values (2, 'Raul', 'Chong', 'Markham', 'CA'), (3, 'Hima', 'Vasudevan', 'Chicago', 'US')''')

### Query data in the table

In [9]:
statement = '''SELECT * FROM INSTRUCTOR'''
cursor_obj.execute(statement)

print("All the data")
output_all = cursor_obj.fetchall()
for row_all in output_all:
    print(row_all)

All the data
(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')

In [10]:
# Fetch few rows from table
statement = '''SELECT * FROM INSTRUCTOR'''
cursor_obj.execute(statement)

print("All the data")
# If you want to fecth few rows from the table we use fetchmany(numberofrows) and mention the number how many rows you want to fetch
output_many = cursor_obj.fetchmany(2)
for row_many in output_many:
    print(row_many)

All the data
(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')

In [12]:
# Fetch only FNAME from the table

statement = '''SELECT FNAME FROM INSTRUCTOR'''
cursor_obj.execute(statement)

print("All the data")
output_column = cursor_obj.fetchall()
for col in output_column:
    print(col)

All the data
('Rav',)
('Raul',)
('Hima',)

In [13]:

query_update = '''update INSTRUCTOR set CITY = "MOOSETOWN" where FNAME="Rav"'''
cursor_obj.execute(query_update)

In [14]:
statement = '''SELECT * FROM INSTRUCTOR'''
cursor_obj.execute(statement)

print("All Data")
output1 = cursor_obj.fetchmany(2)
for row in output1:
    print(row)

All Data
(1, 'Rav', 'Ahuja', 'MOOSETOWN', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')

### Retrieve data into Pandas

In [15]:
import pandas as pd

# retrieve the query results into a pandas dataframe

df = pd.read_sql_query("SELECT * FROM INSTRUCTOR;", conn)

# print the dataframe

df

   ID FNAME      LNAME       CITY CCODE
0   1   Rav      Ahuja  MOOSETOWN    CA
1   2  Raul      Chong    Markham    CA
2   3  Hima  Vasudevan    Chicago    US

In [20]:
#print just the LNAME for first row in the pandas data frame
df.LNAME[0]

'Ahuja'

In [25]:
df.shape

(3, 5)

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      3 non-null      int64
 1   FNAME   3 non-null      object
 2   LNAME   3 non-null      object
 3   CITY    3 non-null      object
 4   CCODE   3 non-null      object
dtypes: int64(1), object(4)
memory usage: 252.0+ bytes

### Close the Connection

In [26]:
# Close the connection

conn.close()